lection = u'Тута можно написать любую лекцию, а потом написать по ней вопросы. Но посмкольку это тестовое задание, я просто напишу сюда любой текст, например из книги "FoE Розовые глазки": Глава первая \n \
Непроницаемая \n \
А вы верите в призраков? \n \
\n \
— Пожалуйста, пустите нас! Щит слабеет, время на исходе!\n \
\n \
Длинная очередь пони нетерпеливо топталась перед воздушным фургоном, но лётчиков-пегасов нигде не было видно. Внезапно зелёная единорожка из задней части толпы с криком бросилась вперёд, отчаянно расталкивая остальных пони:\n \
\n \
— Это невозможно! Этого не может быть! Селестия покинула нас! Луна покинула нас! Мы все...\n \
\n \
БАХ!\n \
\n \
Тело паникёрши рухнуло на землю. Все глаза обратились к пони-солдату, которая вогнала в свой полицейский дробовик новый патрон.\n \
\n \
— ВСЕМ ОСТАВАТЬСЯ В КОЛОННЕ И ЖДАТЬ СВОЕЙ ОЧЕРЕДИ! МЕСТА ХВАТИТ НА ВСЕХ! ПО НАРУШИТЕЛЯМ ПОРЯДКА БУДЕТ ОТКРЫТ ОГОНЬ НА ПОРАЖЕНИЕ!\n \
\n \
\n \
\n \
Совсем крохотная кобылка со светлой гривой и розовой шёрсткой смотрела вверх, в сторону Кантерлота. Огромный блестящий пузырь накрыл всю вершину горы. Розовое облако, запертое в нём, полностью поглотило её внимание: это было самое потрясающее зрелище, какое она видела в своей жизни.\n \
\n \
— Эй, постой-ка!\n \
\n \
Офицер-медик, единорожка в белой униформе, раздававшая защитные костюмы для жеребят, остановилась перед розовой кобылкой и озабоченно взглянула на неё:\n \
\n \
— Ты одна? Где твои родители?\n \
\n \
Малышка улыбнулась в ответ:\n \
\n \
— Мама там, наверху! — Она указала копытцем на силовое поле, окружавшее Кантерлот. Энергетический барьер выглядел сейчас гораздо тоньше, чем десять минут назад. — Она вернётся к обеду!\n \
\n \
Офицер замялась, но потом снова взглянула на жеребёнка и попыталась улыбнуться:\n \
\n \
— Конечно вернётся. Как тебя зовут, крошка?\n \
\n \
— Я Пупписмайл! — радостно представилась та, подпрыгнув на месте.\n \
\n \
— Да... да, Пуппи, хорошо... теперь слушай меня внимательно. Я хочу, чтобы ты взяла этот костюм и надела его. Ты должна всё время его носить и не снимать ни в коем случае, понимаешь?\n \
\n \
Малышка удивлённо взглянула сперва на странный жёлтый свёрток, потом на белую пони:\n \
\n \
— Да, мисс добрая пони! Вы мне нравитесь!\n \
\n \
"О Селестия, она же ещё совсем жеребёнок, её-то за что?.. Проклятая война, она убивает не просто нас, но саму надежду..."\n \
\n \
Единорожка-медик левитировала и развернула костюм: он был лимонно-жёлтый, с несколькими карманами на ногах и парой перемётных сумок по бокам.\n \
\n \
— Вот и хорошо, давай-ка, просовывай сюда копытца. Это как... как в пони-польке! Знаешь пони-польку?\n \
\n \
— Ага! Один шажок вперёд, один шажок назад!\n \
\n \
— Правильно, молодец! Теперь хвост... вот так, давай я тут застегну, а теперь вот эту штуку на голову... готово!\n \
\n \
Медик надела на голову Пупписмайл круглый стеклянный шлем и защёлкнула по паре застёжек с каждой стороны, герметично запечатывая маленькую пони внутри химкостюма.\n \
\n \
— Ух ты! Я как космопони! Как... как капитан Андромеда! Вжжжжжжух! — Малышка принялась носиться кругами, подпрыгивая и простодушно хихикая. Белая пони облегчённо вздохнула и направилась к следующей группе, где видела жеребят.\n \
\n \
\n \
\n \
Пупписмайл супер-пупер-классно проводила время. Сперва были такие большие фейерверки, как суперогромная вечеринка-сюрприз, и вокруг замка появился удивительный пузырь, похожий на мыльный, только большой... большущий... нет, больше! Большушещий! А потом все пони выбежали на улицы и устроили что-то вроде праздника. Пуппи молилась своей счастливой звезде, чтобы мама сегодня пришла пораньше и они смогли бы повеселиться вместе. Последней изюминкой в этом кексике были шлем и скафандр: такие суперклассные, и она наверняка выглядела в них обалденно... Точно! Ей нужно было зеркало! И малышка немедленно помчалась домой.\n \
\n \
\n \
=============================\n \
Думаю этого отрывка хватит'
# print(lection)

question1 = [[['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1]],

            [['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

            [['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

            [['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

             [['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1]]]
