lection = [u'Тута можно написать любую лекцию, а потом написать по ней вопросы. Но посмкольку это тестовое задание, я просто напишу сюда любой текст, например из книги "FoE Розовые глазки": Глава первая \n \
Непроницаемая \n \
А вы верите в призраков? \n \
\n \
— Пожалуйста, пустите нас! Щит слабеет, время на исходе!\n \
\n \
Длинная очередь пони нетерпеливо топталась перед воздушным фургоном, но лётчиков-пегасов нигде не было видно. Внезапно зелёная единорожка из задней части толпы с криком бросилась вперёд, отчаянно расталкивая остальных пони:\n \
\n \
— Это невозможно! Этого не может быть! Селестия покинула нас! Луна покинула нас! Мы все...\n \
\n \
БАХ!\n \
\n \
Тело паникёрши рухнуло на землю. Все глаза обратились к пони-солдату, которая вогнала в свой полицейский дробовик новый патрон.\n \
\n \
— ВСЕМ ОСТАВАТЬСЯ В КОЛОННЕ И ЖДАТЬ СВОЕЙ ОЧЕРЕДИ! МЕСТА ХВАТИТ НА ВСЕХ! ПО НАРУШИТЕЛЯМ ПОРЯДКА БУДЕТ ОТКРЫТ ОГОНЬ НА ПОРАЖЕНИЕ!\n \
\n \
\n \
\n \
Совсем крохотная кобылка со светлой гривой и розовой шёрсткой смотрела вверх, в сторону Кантерлота. Огромный блестящий пузырь накрыл всю вершину горы. Розовое облако, запертое в нём, полностью поглотило её внимание: это было самое потрясающее зрелище, какое она видела в своей жизни.\n \
\n \
— Эй, постой-ка!\n \
\n \
Офицер-медик, единорожка в белой униформе, раздававшая защитные костюмы для жеребят, остановилась перед розовой кобылкой и озабоченно взглянула на неё:\n \
\n \
— Ты одна? Где твои родители?\n \
\n \
Малышка улыбнулась в ответ:\n \
\n \
— Мама там, наверху! — Она указала копытцем на силовое поле, окружавшее Кантерлот. Энергетический барьер выглядел сейчас гораздо тоньше, чем десять минут назад. — Она вернётся к обеду!\n \
\n \
Офицер замялась, но потом снова взглянула на жеребёнка и попыталась улыбнуться:\n \
\n \
— Конечно вернётся. Как тебя зовут, крошка?\n \
\n \
— Я Пупписмайл! — радостно представилась та, подпрыгнув на месте.\n \
\n \
— Да... да, Пуппи, хорошо... теперь слушай меня внимательно. Я хочу, чтобы ты взяла этот костюм и надела его. Ты должна всё время его носить и не снимать ни в коем случае, понимаешь?\n \
\n \
Малышка удивлённо взглянула сперва на странный жёлтый свёрток, потом на белую пони:\n \
\n \
— Да, мисс добрая пони! Вы мне нравитесь!\n \
\n \
"О Селестия, она же ещё совсем жеребёнок, её-то за что?.. Проклятая война, она убивает не просто нас, но саму надежду..."\n \
\n \
Единорожка-медик левитировала и развернула костюм: он был лимонно-жёлтый, с несколькими карманами на ногах и парой перемётных сумок по бокам.\n \
\n \
— Вот и хорошо, давай-ка, просовывай сюда копытца. Это как... как в пони-польке! Знаешь пони-польку?\n \
\n \
— Ага! Один шажок вперёд, один шажок назад!\n \
\n \
— Правильно, молодец! Теперь хвост... вот так, давай я тут застегну, а теперь вот эту штуку на голову... готово!\n \
\n \
Медик надела на голову Пупписмайл круглый стеклянный шлем и защёлкнула по паре застёжек с каждой стороны, герметично запечатывая маленькую пони внутри химкостюма.\n \
\n \
— Ух ты! Я как космопони! Как... как капитан Андромеда! Вжжжжжжух! — Малышка принялась носиться кругами, подпрыгивая и простодушно хихикая. Белая пони облегчённо вздохнула и направилась к следующей группе, где видела жеребят.\n \
\n \
\n \
\n \
Пупписмайл супер-пупер-классно проводила время. Сперва были такие большие фейерверки, как суперогромная вечеринка-сюрприз, и вокруг замка появился удивительный пузырь, похожий на мыльный, только большой... большущий... нет, больше! Большушещий! А потом все пони выбежали на улицы и устроили что-то вроде праздника. Пуппи молилась своей счастливой звезде, чтобы мама сегодня пришла пораньше и они смогли бы повеселиться вместе. Последней изюминкой в этом кексике были шлем и скафандр: такие суперклассные, и она наверняка выглядела в них обалденно... Точно! Ей нужно было зеркало! И малышка немедленно помчалась домой.\n \
\n \
\n \
=============================\n \
Думаю этого отрывка хватит', r'Термин "философия" происходит от греческих слов phileo — любовь и sophia — мудрость и'
                             r' означает любовь к мудрости. На вопрос, что же такое мудрость сами философы отвечали на '
                             r'него по-разному и мудрствовали каждый по-своему. С этим связано и различное понимание '
                             r'философии. Первым, кто объяснил слово "философ", был Пифагор (вторая пол. VI в. —'
                             r' начало V в. до н. э). Ему принадлежит высказывание: "Жизнь... подобна игрищам: иные '
                             r'приходят на них состязаться, иные — торговать, а самые счастливые — смотреть; так и в '
                             r'жизни иные, подобные рабам, рождаются жадными до славы и наживы, между тем как философы '
                             r'— до единой только истины". Согласно Пифагору, смысл философии — в поиске истины.'
                             r' Другого мнения придерживались софисты (греч. sophistes — мастер, художник). Главная '
                             r'задача философа, считали они, — научить своих учеников мудрости. Мудрость они '
                             r'отождествляли не с достижением истины, а с умением доказывать то, что каждый сам считает'
                             r' правильным и выгодным. Для этого признавались приемлемыми любые средства, вплоть до '
                             r'различного рода уловок и ухищрений. Древнегреческий мыслитель Платон полагал, что задача'
                             r' философии заключается в познании вечных и абсолютных истин, что под силу лишь философам'
                             r', которые от рождения наделены соответствующей мудрой душой. Философами поэтому не'
                             r' становятся, а рождаются. По мнению Аристотеля, задача философии — постижение'
                             r' всеобщего в самом мире, а ее предметом являются первые начала и причины бытия. При '
                             r'этом философия является единственной наукой, которая существует ради самой себя и'
                             r' представляет "знание и понимание ради самого знания и понимания". Следует отметить, '
                             r'что понимание предмета философии связано и с социально-историческими условиями. Так,'
                             r' например, разложение общества (греческого, античного, средневекового и т.п.), '
                             r'безусловно, повлияло на появление концепций, согласно которым философия призвана'
                             r' освободить человека от страха перед будущим и страдании и способствовать достижению'
                             r' счастья и душевного здоровья. Философию отличает разнообразие подходов (и пониманий) '
                             r'к своему собственному предмету, что свидетельствует о его плюралистическом '
                             r'(множественном) характере. Однако сказанное вовсе не означает, что различным '
                             r'философским концепциям не присуще общее. Можно вычленить существенные моменты, '
                             r'свойственные предмету философии вообще: исследование наиболее общих вопросов бытия. '
                             r'При этом сама проблема бытия понимается в универсальном смысле. Бытие и небытие; '
                             r'бытие материальное и идеальное; бытие природы, общества и человека; анализ наиболее'
                             r' общих вопросов познания. Познаваем или непознаваем мир; каковы возможности, методы и '
                             r'цели познания; в чем заключается сущность самого познания и что есть истина; каков '
                             r'субъект и объект познания; изучение наиболее общих вопросов функционирования и '
                             r'развития общества; исследование наиболее общих и существенных вопросов человека. Таким '
                             r'образом, философию можно определить как учение об общих принципах бытия, познания и '
                             r'отношений человека и мира. Прежде всего, философия всегда оформляется в виде теории, '
                             r'формулирующей свои категории и их систему, закономерности, методы и принципы '
                             r'исследования. Специфика философской теории заключается в том, что ее законы, '
                             r'категории и принципы носят всеобщий характер, распространяются одновременно на '
                             r'природу, общество, человека и само мышление. В последнем случае философия выступает '
                             r'как мышление о мышлении. Предмет философии непременно включает и рассмотрение вопроса '
                             r'о том, что такое сама философия, изучение ее истории. Философия как сложившаяся '
                             r'система знаний имеет целый ряд специфических вопросов, которые она призвана решать. '
                             r'Каждая философская система имеет стержневой, главный вопрос, раскрытие которого '
                             r'составляет ее основное содержание и сущность. Так, для античных философов это вопрос о '
                             r'первоосновах всего существующего, для Сократа он связан с принципом "познай самого '
                             r'себя", для философов Нового времени — как возможно познание, для современного '
                             r'позитивизма — в чем суть "логики научного открытия". Но существуют общие вопросы, '
                             r'раскрывающие характер философского мышления. Прежде всего, среди них вопрос: "Что '
                             r'первично: дух или материя, идеальное или материальное?" От его решения зависит общее '
                             r'понимание бытия, ибо материальное и идеальное являются его предельными '
                             r'характеристиками. В зависимости от его решения выделяются такие крупные философские '
                             r'направления, как материализм и идеализм. Каждая наука имеет свой метод. Однако '
                             r'философия выступает в качестве наиболее общей методологии, и в этом суть ее '
                             r'собственного метода. Можно сказать, что философский метод (от греч. methodos — путь, '
                             r'познание) есть система наиболее общих приемов теоретического и практического освоения '
                             r'действительности, а также способ построения и обоснования системы самого философского '
                             r'знания. Как и методы других наук, он берет начало в практической деятельности людей и '
                             r'в своем истоке является отражением логики и закономерностей развития объективной '
                             r'действительности. Это относится, конечно, только к такой философии, которая опирается '
                             r'на науку. Философский метод задает общие принципы исследования. Однако различные '
                             r'философские школы и направления в соответствии со своей спецификой и пониманием '
                             r'предмета философии формулируют и используют различные философские методы. Плюрализму '
                             r'философских концепций соответствует и плюрализм методов (дедукция, логические методы; '
                             r'индукция, опытные методы; эксперимент; рефлексия, самонаблюдение). Общее, '
                             r'что свойственно им всем, — теоретическое мышление, выраженное в философских '
                             r'категориях, принципах и законах. Материализм и идеализм выступают как наиболее общие '
                             r'подходы и способы рассмотрения бытия и познания. Теория познания с самого начала во '
                             r'многом определяется тем, что берется за первичное: материя или сознание, '
                             r'дух или природа, т.е. материалистические или идеалистические предпосылки. В первом '
                             r'случае, общий процесс познания рассматривается как отражение в сознинии объективной '
                             r'действительности, во втором — как самопознание сознания, абсолютной идеи, изначально '
                             r'присутствующих в вещах (объективный идеализм), или как анализ наших собственных '
                             r'ощущений (субъективный идеализм). Следующий аспект различения философских методов — '
                             r'диалектика и метафизика. Под диалектикой имеют в виду учение о наиболее общих '
                             r'закономерностях развития бытия и познания, одновременно она выступает и общим методом '
                             r'освоения действительности, рассматривая ее как единство и борьбу противоположностей. '
                             r'Диалектика в принципе совместима как с материализмом, так и с идеализмом. В первом '
                             r'случае она выступает как материалистическая диалектика (Маркс, Энгельс), во втором — '
                             r'как идеалистическая диалектика (Гегель). Диалектика возникла и развивалась наряду с '
                             r'метафизикой как противоположным ей способом мышления и познания. Ее особенность — '
                             r'тенденция к созданию однозначной, статичной картины мира, стремление к абсолютизации и '
                             r'изолированному рассмотрению тех или иных моментов или фрагментов бытия. Метафизический '
                             r'метод характеризуется тем, что рассматривает предметы и процессы по одному принципу: '
                             r'либо да, либо нет; либо белое, либо черное; либо друг, либо враг и т.д. При '
                             r'рассмотрении движения метафизика тяготеет к сведению многообразных его форм к '
                             r'какой-либо одной. Так, например, для материализма Нового времени было характерно '
                             r'сведение различных форм движения материи к механической (механистический материализм). '
                             r'Методологическая ошибка возникает тогда, когда этот момент покоя или какая-либо одна '
                             r'характеристика, сторона предмета исследования вырывается из всеобщей взаимосвязи и '
                             r'взаимообусловленности и возводится в абсолют. Помимо указанных методов философия '
                             r'включает в себя и другие. Отметим некоторые из них, имеющие наибольшее значение и '
                             r'распространение: Сенсуализм (от лат sensus — чувство) — методологический принцип, '
                             r'в котором за основу познания берутся чувства и который стремится все знание вывести из '
                             r'деятельности органов чувств, ощущений, абсолютизируя их роль в познании (Эпикур, '
                             r'Гоббс, Локк, Беркли, Гольбах, Фейербах). Рационализм (от лат ratio — разум) — метод, '
                             r'согласно которому основой познания и действия людей является разум (Декарт, Спиноза, '
                             r'Лейбниц, Гегель). Иррационализм — философский метод, который отрицает или, по крайней '
                             r'мере, ограничивает роль разума в познании, а уделяет основное внимание иррациональным '
                             r'способам постижения бытия (Шопенгауэр, Кьеркегор, Ницше, Дильтей, Бергсон). Бурное '
                             r'развитие науки и познания в последние десятилетия привели к осмыслению методологии как '
                             r'специализированной области знания. В ее рамках исследуются внутренние механизмы, '
                             r'логика и организация знания (науки). В частности, рассматриваются критерии научности '
                             r'знания, проводится анализ языка науки, прослеживаются логика и рост научного знания, '
                             r'структура научных революций. Предмет и специфику философии нельзя раскрыть в '
                             r'достаточной степени полно, не затрагивая вопроса о ее функциях, среди которых следует '
                             r'отметить такие:  Мировоззренческая функция, которая связана с абстрактно — '
                             r'теоретическим, понятийным объяснением мира, в отличие от всех других видов и уровней '
                             r'мировоззрения (религиозного, обыденного, мифологического).  Методологическая функция '
                             r'заключается в том, что философия выступает как общее учение о методе и как '
                             r'совокупность наиболее общих методов познания и освоения действительности человеком.  '
                             r'Прогностическая функция философии — формулировку в ее рамках гипотез об общих '
                             r'тенденциях развития материи и сознания, человека и мира. При этом степень вероятности '
                             r'прогноза будет тем выше, чем больше философия опирается на науку.  Функция философии '
                             r'как школы теоретического мышления и мудрости. Особенно это касается изучения истории '
                             r'философии.  Критическая функция философии. Принцип "подвергай все сомнению", '
                             r'со времен античности проповедуемый многими философами, свидетельствует о важности '
                             r'критического подхода и наличии определенной доли скепсиса по отношению к существующему '
                             r'знанию и социокультурным ценностям. Он играет антидогматическую роль в их развитии. . '
                             r' С критической функцией философии тесно связана и ее аксиологическая функция (от '
                             r'греч. axios — ценный). Любая философская система содержит в себе момент оценки '
                             r'исследуемого объекта с точки зрения самых различных ценностей: социальных, '
                             r'нравственных, эстетических, идеологических. Особенно остро эта функция проявляется в '
                             r'переходные периоды общественного развития, когда возникает проблема выбора пути '
                             r'движения и встает вопрос, что следует отбросить, а что сохранить из старых ценностей. '
                             r' Социальная функция философии: философия призвана выполнить двуединую задачу — '
                             r'объяснять социальное бытие и способствовать его материальному и духовному изменению. '
                             r'При этом следует помнить, что в общественной жизни социальные изменения, эксперименты '
                             r'и реформы имеют особую ценность и значение. Поэтому прежде чем пытаться изменить '
                             r'социальный мир, нужно предварительно его хорошо объяснить. Именно философии '
                             r'принадлежит прерогатива в разработке всеобъемлющих концепций интеграции и консолидации '
                             r'человеческого общества.  С социальной функцией тесно связана функция философии, '
                             r'которую называют гуманитарной. Философия должна играть адаптационную и '
                             r'жизнеутверждающую роль для каждого индивида, способствовать формированию '
                             r'гуманистических ценностей и идеалов, утверждению позитивного смысла и цели жизни. Она, '
                             r'таким образом, призвана осуществлять функцию интеллектуальной терапии, '
                             r'которая особенно важна в периоды нестабильного состояния общества, когда человеческое '
                             r'существование находится в "пограничной ситуации", и каждый должен делать свой выбор.']

question1 = [[[['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1]],

            [['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

            [['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

            [['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0]],

            [['Это неверный ответ', 0],
             ['Это верный ответ', 1],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0]],

             [['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это неверный ответ', 0],
             ['Это верный ответ', 1]]],

             [[['Динамический процесс вопрошания, поиска удела человека', 1],
               ['Собрание теорий, концепций философов', 0],
               ['Наука, исследующая язык', 0],
               ['учение о познаваемости мира', 0]],

              [['Рассуждение', 0],
               ['Компетентное мнение', 0],
               ['Любовь к мудрости', 1],
               ['Логику', 0]],

              [['Устройство мира', 0],
               ['Красота мира', 0],
               ['Счастье человека', 0],
               ['Всеобщее в системе «мир-человек»', 1]],

              [['Мировоззренческая и познавательная', 0],
               ['Методологическая и прогностическая', 0],
               ['Аксиологическая и ориентационная', 0],
               ['Все эти функции вместе взятые', 1]],

              [['Мифологических образов', 0],
               ['Откровения', 0],
               ['Интуитивного прозрения', 0],
               ['Рациональной аргументации', 1]],

              [['Мировоззрение', 1],
               ['Мирочувствование', 0],
               ['Мироощущение', 0],
               ['Мировосприятие', 0]],

              [['Религиозных верованиях', 0],
               ['Мифологических представлениях', 0],
               ['Научных исследованиях', 0],
               ['Доводах и умозаключениях разума', 1]],

              [['Вопрос об отношении сознания к бытию, идеального к материальному', 1],
               ['Каковы критерии истины?', 0],
               ['Как возник мир?', 0],
               ['Что есть Бог?', 0]],

              [['Разумное миропонимание', 1],
               ['Откровение', 0],
               ['Истинное мироощущение', 0],
               ['Специфическое мировосприятие', 0]],

              [['Конкретность', 0],
               ['Наглядность', 0],
               ['Абстрактность', 1],
               ['Системность', 0]]
              ]]

# print(question1[1][0][2])
qestion =['1. Философия – это (укажите наиболее правильный ответ):',
          '2. Термин «философия» означает:',
          '3. Предмет философии – это (укажите наиболее правильный ответ):',
          '4. Философии присущи функции:',
          '5. Философия объясняет мир с помощью:',
          '6. Философия — это:',
          '7. Ответы на философские вопросы ищут в:',
          '8. Основной вопрос философии – это (укажите наиболее правильный ответ):',
          '9. Философия – это (укажите наиболее правильный ответ):',
          '10. Необходимым признаком философского мировоззрения является:']